#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");

	cout << "Hello World!" <<endl;


	/***Написать функцию, которой передается не пустой одномерный целочисленный массив, 
		она должна вернуть истину если в массиве есть место, в котором сумма левой и 
		правой части массива равны.Примеры: checkBalance([1, 1, 1, || 2, 1]) → true, checkBalance([2, 1, 1, 2, 1]) → false, 
		checkBalance([10, || 1, 2, 3, 4]) → true.Абстрактная граница показана символами || , эти символы в массив не входят.*/



}


